#include "Token.h"
#include <sstream>
#include "error.h"

using namespace std;

/*******************************************************************************
                                   词法记号名字
*******************************************************************************/

const char * tokenName[]=
{
	"error",
	"文件结尾",
	"标识符",
	"#",
	"include",
	"define",
};

/*******************************************************************************
                                   词法记号
*******************************************************************************/

Token::Token (Symbol t):sym(t) { }

string Token::toString()
{
	return std::string(tokenName[sym]);
}

Token::~Token () { }


/*******************************************************************************
                                   标识符
*******************************************************************************/

ID::ID (string n):Token(IDENT),name(n) { }

string ID::toString()
{
	return Token::toString()+name;
}


